// Домашнее задание:
//     1 Создать функцию, генерирующую шахматную доску. При этом можно использовать любые
// html-теги по своему желанию.
//     Доска должна быть разлинована соответствующим образом, т.е. чередовать черные и белые
// ячейки.
//     Строки должны нумероваться числами от 1 до 8, столбцы – латинскими буквами A, B, C, D, E, F,
//     G, H.



// 2*. Заполнить созданную таблицу фигурами, фигуры должны выглядеть как картинки, либо
// можно использовать символы (существуют символы шахматных фигур) причем все фигуры
// должны стоять на своих местах и быть соответственно черными и белыми.


// 3**. Создать форму в html со следующими полями:
//     * Имя - текстовое поле
// * Телефон - текстовое поле
// * Пароль - поле типа password
// * Повтор пароля - поле типа password
// * Кнопка отправить форму
// Необходимо реализовать валидацию этой формы по следующим правилам:
//     * Имя - должно содержать как минимум 1 символ, не более 50 символов.
// * Телефон - должно содержать 11 цифр, не больше, не меньше.
// * Пароль - минимум 5 символов, максимум 50
// * Повтор пароля - значение должно совпадать с полем пароль.
// * Кнопка отправить форму - при нажатии на кнопку форма должна провериться, при
// прохождении проверки, форма
// отправляется, если проверка не была пройдена, то:
// - Каждое поле, которое не прошло проверку должно выделяться красным цветом.
// - Под каждым полем, что не прошло проверку, должна писаться подсказка по какой причине
// проверка провалилась.
//     Можете пользоваться стилями бутстрапа, если лень самим писать.
//     Пользоваться аттрибутами HTML5 запрещено, необходимо проверки реализовать с помощью
// javascript.